src/toir_cf/src/Documents/торо_ГрафикРегламентныхМероприятийТОиР/торо_ГрафикРегламентныхМероприятийТОиР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ГрафикРегламентныхМероприятийТОиР</name>
  <basedOn>Document.торо_ГрафикРегламентныхМероприятийТОиР</basedOn>
  <registerRecords>InformationRegister.торо_ВсеДокументыПоРемонтам</registerRecords>
  <registerRecords>InformationRegister.торо_ЗапланированныеМероприятияОбъектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыРемонтов</registerRecords>
  <registerRecords>InformationRegister.торо_СоответствиеКорректировокДокументамППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПериодыПланированияППР</registerRecords>
  <registerRecords>InformationRegister.торо_ПлановыеМероприятия</registerRecords>
  <attributes>
    <name>ДатаПланирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьДетализации</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ФлагВыводДиаграммы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.торо_ВидыОперацийПланаГрафикаППР</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ГрафикРегламентныхМероприятийТОиР</types>
    </type>
  </attributes>
  <attributes>
    <name>РассчитаноНаВерсииППР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПланРемонтов</name>
    <attributes>
      <name>ID</name>
      <comment>ID ремонта</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СписокОбъектовРемонта</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтныхРабот</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКон</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНач</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СпособВыполнения</name>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </attributes>
    <attributes>
      <name>Отменен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ID_базы_расчета</name>
      <comment>Id базы расчета</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ID_замещающего</name>
      <comment>Id замещающего</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачСт</name>
      <comment>Дата начала ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаКонСт</name>
      <comment>Дата окончания ремонтных работ планируемая</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗамещенСт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаРемонта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоНормативу</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СодержитВыходные</name>
      <comment>Добавлено под нужды проектов, потому по умолчанию скрыто</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>СписокОбъектовРемонта</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидМероприятия</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбъектыМаршрутов</name>
    <comment>Не используется</comment>
    <attributes>
      <name>СписокОбъектовРемонта</name>
      <type>
        <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/Enums/СпособыСтроительства/СпособыСтроительства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыСтроительства</name>
  <enumValues>
    <name>Подрядный</name>
    <comment>С привлечением подрядных организаций</comment>
  </enumValues>
  <enumValues>
    <name>Хозспособ</name>
    <comment>Строительство собственными силами</comment>
  </enumValues>
</mdclass:Enum>

src/toir_cf/src/Catalogs/СтруктураПредприятия/СтруктураПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураПредприятия</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекущийРуководитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СоответствуетСтруктуреЮридическихЛиц</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Расформировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРасформирования</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>проф_ПризнакПодразделенияОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Catalogs/Контрагенты/Контрагенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Контрагенты</name>
  <predefined>
    <items>
      <name>РозничныйПокупатель</name>
      <description>Розничный покупатель</description>
    </items>
  </predefined>
  <attributes>
    <name>ГоловнойКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>DefinedType.ИНН</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/toir_cf/src/Documents/торо_ГрафикРегламентныхМероприятийТОиР/Forms/ФормаАвтозаполненияИсполнителей/Module.bsl
&НаКлиенте
Перем МассивВыбранныхВидовРемонтов;

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ДокументППР") Тогда
		ДокументППР = Параметры.ДокументППР;
	КонецЕсли;
	
	Если Параметры.Свойство("ТаблицаРемонтовИзППР") Тогда
		ТаблицаРемонтовИзППР.Загрузить(Параметры.ТаблицаРемонтовИзППР.Выгрузить());
	Иначе
		ТаблицаРемонтовИзППР.Загрузить(ДокументППР.ПланРемонтов.Выгрузить());
	КонецЕсли;
	
	Для каждого Ремонт Из ТаблицаРемонтовИзППР Цикл
	    Если ЗначениеЗаполнено(Ремонт.Исполнитель) Тогда
		    Ремонт.ИсполнительЗаполнен = Истина;
		Иначе
			Ремонт.ИсполнительЗаполнен = Ложь;
			Если Ремонт.СпособВыполнения = Перечисления.СпособыСтроительства.Хозспособ Тогда
				Ремонт.Исполнитель = Справочники.СтруктураПредприятия.ПустаяСсылка();
			Иначе
			    Ремонт.Исполнитель = Справочники.Контрагенты.ПустаяСсылка();
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла;
	
	Если Параметры.Свойство("МассивДоступныхДляКорректировкиСтрок") Тогда 
		Для Каждого СтрокаДоступности Из Параметры.МассивДоступныхДляКорректировкиСтрок Цикл
			Если СтрокаДоступности.ДоступенДляРедактирования Тогда
				СтрокиРемонта = ТаблицаРемонтовИзППР.НайтиСтроки(Новый Структура("ID", СтрокаДоступности.ID));
				Если СтрокиРемонта.Количество() > 0 Тогда
					СтрокиРемонта[0].ДоступенДляРедактирования = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Элементы.ДокументППР.Заголовок = Строка(ДокументППР);
	
	ТолькоДляНеустановленныхИсполнителей = Истина;
	НеОчищатьИсполнителей = Истина;
	НеМенятьСпособВыполнения = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьФлажки(Элементы.ТаблицаРемонтовИзППРУстановитьФлажки);
	
	УстановитьДоступностьКонтрагентаПодразделения();

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпособВыполненияПриИзменении(Элемент)
	УстановитьДоступностьКонтрагентаПодразделения();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		СтрокаТабличнойЧасти.Пометка = СтрокаТабличнойЧасти.ДоступенДляРедактирования;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		СтрокаТабличнойЧасти.Пометка = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьФлажки(Команда)
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		СтрокаТабличнойЧасти.Пометка = (Не СтрокаТабличнойЧасти.Пометка И СтрокаТабличнойЧасти.ДоступенДляРедактирования);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура НезаполненныеИсполнителиПриИзменении(Элемент)
	Если НезаполненныеИсполнители Тогда
		Элементы.ТаблицаРемонтовИзППР.ОтборСтрок = Новый ФиксированнаяСтруктура("ИсполнительЗаполнен", Ложь);
	Иначе
		Элементы.ТаблицаРемонтовИзППР.ОтборСтрок = Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИсполнителей(Команда)
	
	СтруктураВозврата = ПолучитьПредопределенныеЗначенияНаСервере();
	СпособыСтроительстваПустаяСсылка = СтруктураВозврата.СпособыСтроительстваПустаяСсылка;
	СпособыСтроительстваХозспособ = СтруктураВозврата.СпособыСтроительстваХозспособ;
	СпособыСтроительстваПодрядный = СтруктураВозврата.СпособыСтроительстваПодрядный;
	СтруктураПредприятияПустаяСсылка = СтруктураВозврата.СтруктураПредприятияПустаяСсылка;
	КонтрагентыПустаяСсылка = СтруктураВозврата.КонтрагентыПустаяСсылка;
	
	Для каждого СтрокаТабличнойЧасти Из ТаблицаРемонтовИзППР Цикл
		ИзменятьСтроку = СтрокаТабличнойЧасти.Пометка И (НезаполненныеИсполнители И Не СтрокаТабличнойЧасти.ИсполнительЗаполнен Или Не НезаполненныеИсполнители);
		Если ИзменятьСтроку Тогда
			Если СтрокаТабличнойЧасти.СпособВыполнения = Неопределено 
				ИЛИ СтрокаТабличнойЧасти.СпособВыполнения = СпособыСтроительстваПустаяСсылка
				ИЛИ НЕ НеМенятьСпособВыполнения Тогда
				Если Не СтрокаТабличнойЧасти.СпособВыполнения = СпособВыполнения Тогда
					СтрокаТабличнойЧасти.СпособВыполнения = СпособВыполнения;
					СтрокаТабличнойЧасти.Исполнитель = Неопределено;
				КонецЕсли;
			КонецЕсли;
			Если СтрокаТабличнойЧасти.СпособВыполнения = СпособыСтроительстваХозспособ Тогда 
				Если НЕ Подразделение = СтруктураПредприятияПустаяСсылка 
					или (Подразделение = СтруктураПредприятияПустаяСсылка и НЕ НеОчищатьИсполнителей) Тогда 
					Если СтрокаТабличнойЧасти.Исполнитель = СтруктураПредприятияПустаяСсылка
						или НЕ ТолькоДляНеустановленныхИсполнителей 
						или СтрокаТабличнойЧасти.Исполнитель = Неопределено 
						или (ТолькоДляНеустановленныхИсполнителей и СтрокаТабличнойЧасти.Исполнитель = Неопределено)Тогда 
						СтрокаТабличнойЧасти.Исполнитель = Подразделение;
						торо_ЗаполнениеДокументовКлиент.ЗаполнитьСклад(СтрокаТабличнойЧасти.Исполнитель, СтрокаТабличнойЧасти.Склад);
						СтрокаТабличнойЧасти.ИсполнительЗаполнен = ?(ЗначениеЗаполнено(Подразделение), Истина, Ложь);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаТабличнойЧасти.СпособВыполнения = СпособыСтроительстваПодрядный Тогда 
				Если Не Контрагент = КонтрагентыПустаяСсылка
					или (Контрагент = КонтрагентыПустаяСсылка и НЕ НеОчищатьИсполнителей) Тогда 
					Если СтрокаТабличнойЧасти.Исполнитель = КонтрагентыПустаяСсылка 
						или НЕ ТолькоДляНеустановленныхИсполнителей
						или СтрокаТабличнойЧасти.Исполнитель = Неопределено 
						или (ТолькоДляНеустановленныхИсполнителей и (СтрокаТабличнойЧасти.Исполнитель = КонтрагентыПустаяСсылка или СтрокаТабличнойЧасти.Исполнитель = Неопределено))Тогда 
						СтрокаТабличнойЧасти.Исполнитель = Контрагент;
						СтрокаТабличнойЧасти.ИсполнительЗаполнен = ?(ЗначениеЗаполнено(Контрагент), Истина, Ложь);
					КонецЕсли;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если НезаполненныеИсполнители Тогда
		Элементы.ТаблицаРемонтовИзППР.ОтборСтрок = Новый ФиксированнаяСтруктура("ИсполнительЗаполнен", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СоответствиеИсполнителей = Новый Соответствие;
	Для каждого Строка из ТаблицаРемонтовИзППР Цикл
		СоответствиеИсполнителей.Вставить(Строка.ID, Строка);
	КонецЦикла;
	
	Закрыть(СоответствиеИсполнителей);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервереБезКонтекста
Функция ПолучитьПредопределенныеЗначенияНаСервере()
	
	Возврат Новый Структура("СпособыСтроительстваПустаяСсылка, СпособыСтроительстваХозспособ, СпособыСтроительстваПодрядный, СтруктураПредприятияПустаяСсылка, КонтрагентыПустаяСсылка",
	Перечисления.СпособыСтроительства.ПустаяСсылка(), Перечисления.СпособыСтроительства.Хозспособ, Перечисления.СпособыСтроительства.Подрядный, Справочники.СтруктураПредприятия.ПустаяСсылка(), Справочники.Контрагенты.ПустаяСсылка());
	
Конецфункции

&НаКлиенте
Процедура УстановитьДоступностьКонтрагентаПодразделения()
	
	СпособВыполненияЗаполнен = ЗначениеЗаполнено(СпособВыполнения);
	ДоступностьЭлементов = (СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ"));
	Элементы.Контрагент.Доступность = СпособВыполненияЗаполнен И НЕ ДоступностьЭлементов;
	Элементы.Подразделение.Доступность = СпособВыполненияЗаполнен И ДоступностьЭлементов;
	
	Если НЕ Элементы.Контрагент.Доступность Тогда
		Контрагент = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
	КонецЕсли;
	
	Если НЕ Элементы.Подразделение.Доступность Тогда
		Подразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРемонтовИзППРПередНачаломИзменения(Элемент, Отказ)
	Если Не Элементы.ТаблицаРемонтовИзППР.ТекущиеДанные.ДоступенДляРедактирования Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРемонтовИзППРПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	ТекДанные = Элементы.ТаблицаРемонтовИзППР.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекДанные.Исполнитель) Тогда
	    ТекДанные.ИсполнительЗаполнен = Истина;
		Если НезаполненныеИсполнители Тогда
		    Элементы.ТаблицаРемонтовИзППР.ОтборСтрок = Новый ФиксированнаяСтруктура("ИсполнительЗаполнен", Ложь);
		КонецЕсли; 
	Иначе
	    ТекДанные.ИсполнительЗаполнен = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаРемонтовИзППРСпособВыполненияПриИзменении(Элемент)
	ТекущиеДанные = Элементы.ТаблицаРемонтовИзППР.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено Тогда
		Если ТекущиеДанные.СпособВыполнения = ПредопределенноеЗначение("Перечисление.СпособыСтроительства.Хозспособ") Тогда
			ТекущиеДанные.Исполнитель = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
		Иначе	
			ТекущиеДанные.Исполнитель = ПредопределенноеЗначение("Справочник.Контрагенты.ПустаяСсылка");
		КонецЕсли; 
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоВидуРемонта(Команда)
	
	МассивВидовРемонтов = Новый Массив;
	Для каждого Ремонт Из ТаблицаРемонтовИзППР Цикл
	    Если МассивВидовРемонтов.Найти(Ремонт.ВидРемонтныхРабот) = Неопределено Тогда
			МассивВидовРемонтов.Добавить(Ремонт.ВидРемонтныхРабот);
		КонецЕсли; 
	КонецЦикла; 
	
	ПараметрыФормы = Новый Структура("ДокументППР, МассивВыбранныхВидовРемонтов, МассивВидовРемонтов", ДокументППР, МассивВыбранныхВидовРемонтов, МассивВидовРемонтов);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборПоВидуРемонтаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Документ.торо_ПланГрафикРемонта.Форма.ФормаВыбораВидовРемонтов", ПараметрыФормы, Элементы.ТаблицаРемонтовИзППР,,,,ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборПоВидуРемонтаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для каждого СтрокаТЗ Из ТаблицаРемонтовИзППР Цикл
			Если СтрокаТЗ.ДоступенДляРедактирования Тогда
				СтрокаТЗ.Пометка = Истина;
			    Если Результат.Найти(СтрокаТЗ.ВидРемонтныхРабот) = Неопределено Тогда
					СтрокаТЗ.Пометка = Ложь;
				КонецЕсли;
			КонецЕсли; 			
		КонецЦикла;
		
		МассивВыбранныхВидовРемонтов = Результат;
	КонецЕсли; 
	
КонецПроцедуры


#КонецОбласти
